import { Component } from '@angular/core';

@Component({
  selector: 'app-spiritual',
  imports: [],
  template: `
    <h1>Spiritual</h1>
    <p><b>శరీర శుద్ధి</b></p>
    <p>శ్లో॥ అపవిత్రః పవిత్రో వా సర్వావస్థాం᳚ గతోఽపివా ।<br>
      యః స్మరేత్ పుండరీకాక్షం స బాహ్యాభ్యంతరశ్శుచిః ॥</p>
    <p>
      <b>నమస్కార శ్లోకః</b><br>
      త్వమేవ మాతా చ పితా త్వమేవ, త్వమేవ బంధుశ్చ సఖా త్వమేవ । <br>
      త్వమేవ విద్యా ద్రవిణం త్వమేవ, త్వమేవ సర్వం మమ దేవదేవ ॥
    </p>
    <p>
      <b>భస్మ ధారణ శ్లోకః</b><br>
      శ్రీకరం చ పవిత్రం చ శోక నివారణమ్ ।<br>
      లోకే వశీకరం పుంసాం భస్మం త్ర్యైలోక్య పావనమ్ ॥
    </p>
    <p><b>అపరాధ క్షమాపణ స్తోత్రం</b><br>
      అపరాధ సహస్రాణి, క్రియంతేఽహర్నిశం మయా ।<br>
      దాసోఽయమితి మాం మత్వా, క్షమస్వ పరమేశ్వర ॥</p>
    <p>కరచరణ కృతం-వాఀ కర్మ వాక్కాయజం-వాఀ<br>
      శ్రవణ నయనజం-వాఀ మానసం-వాఀపరాధమ్ ।<br>
      విహిత మవిహితం-వాఀ సర్వమేతత్ క్షమస్వ<br>
      శివ శివ కరుణాబ్ధే శ్రీ మహాదేవ శంభో ॥</p>
    <p>కాయేన వాచా మనసేంద్రియైర్వా<br>
      బుద్ధ్యాత్మనా వా ప్రకృతేః స్వభావాత్ ।<br>
      కరోమి యద్యత్సకలం పరస్మై <br>
      నారాయణాయేతి సమర్పయామి ॥</p>
    <p><b>కార్య ప్రారంభ స్తోత్రాః</b><br>
      శుక్లాం బరధరం-విఀష్ణుం శశివర్ణం చతుర్భుజమ్ ।<br>
      ప్రసన్నవదనం ధ్యాయేత్ సర్వ విఘ్నోపశాంతయే ॥</p>
    <p>అగజానన పద్మార్కం గజానన మహర్నిశమ్ ।<br>
      అనేకదం-తం భక్తానాం-ఏకదంత-ముపాస్మహే ॥</p>
    <p>యస్యద్విరద వక్త్రాద్యాః పారిషద్యాః పరశ్శతమ్ ।<br>
      విఘ్నం నిఘ్నంతు సతతం-విఀష్వక్సేనం తమాశ్రయే ॥</p>
    <p><b>గణేశ స్తోత్రం</b><br>
      వక్రతుండ మహాకాయ సూర్యకోటి సమప్రభః ।<br>
      నిర్విఘ్నం కురు మే దేవ సర్వ కార్యేషు సర్వదా ॥</p>
    <p><b>ఆచమనం</b><br>
      ఓం ఆచమ్య ।<br>
 ఓం కేశవాయ స్వాహా ।<br>
 ఓం నారాయణాయ స్వాహా ।<br>
 ఓం మాధవాయ స్వాహా ।<br>
 ఓం గోవిందాయ నమః ।<br>
 ఓం-విఀష్ణవే నమః ।<br>
 ఓం మధుసూదనాయ నమః ।<br>
 ఓం త్రివిక్రమాయ నమః ।<br>
 ఓం-వాఀమనాయ నమః ।<br>
 ఓం శ్రీధరాయ నమః ।<br>
 ఓం హృషీకేశాయ నమః ।<br>
 ఓం పద్మనాభాయ నమః ।<br>
 ఓం దామోదరాయ నమః ।<br>
 ఓం సంకర్​షణాయ నమః ।<br>
 ఓం-వాఀసుదేవాయ నమః ।<br>
 ఓం ప్రద్యుమ్నాయ నమః ।<br>
 ఓం అనిరుద్ధాయ నమః ।<br>
 ఓం పురుషోత్తమాయ నమః ।<br>
 ఓం అధోక్షజాయ నమః ।<br>
 ఓం నారసింహాయ నమః ।<br>
 ఓం అచ్యుతాయ నమః ।<br>
 ఓం జనార్ధనాయ నమః ।<br>
 ఓం ఉపేంద్రాయ నమః ।<br>
 ఓం హరయే నమః ।<br>
 ఓం శ్రీకృష్ణాయ నమః ।<br>
 ఓం శ్రీకృష్ణ పరబ్రహ్మణే నమో నమః ।<br>
</p>
    <p><b>భూతోచ్చాటన</b><br>
      ఉత్తిష్ఠంతు । భూత పిశాచాః । యే తే భూమిభారకాః । <br>
      యే తేషామవిరోధేన । బ్రహ్మకర్మ సమారభే । ఓం భూర్భువస్సువః ।</p>
    <p><b>ప్రాణాయామం</b><br>
      ఓం భూః । ఓం భువః । ఓగ్ం సువః । ఓం మహః । ఓం జనః । ఓం తపః । ఓగ్ం స॒త్యమ్ ।<br>
      ఓం తథ్స॑వి॒తుర్వరే᳚ణ్యం॒ భర్గో॑ దే॒వస్య॑ ధీమహి । <br>
      ధియో॒ యో నః॑ ప్రచోదయా᳚త్ ॥<br>
      ఓమాపో॒ జ్యోతీ॒ రసో॒ఽమృతం॒ బ్రహ్మ॒ భూ-ర్భువ॒-స్సువ॒రోమ్ ॥ (తై. అర. 10-27)<br>
      <br>
      <b>సంకల్పం</b><br>
      మమోపాత్త, దురితక్షయద్వారా, శ్రీ పరమేశ్వర ప్రీత్యర్థం, శుభే, శోభనేముహూర్తే, మహావిష్ణోరాజ్ఞయా, ప్రవర్తమానస్య<br>
      అద్యబ్రహ్మణః ద్వితీయపరార్థే, శ్వేతవరాహకల్పే, వైవశ్వతమన్వంతరే, కలియుగే, ప్రథమపాదే, శాల్మలీ ద్వీపే, విన్యాశ్చిత పశ్చిమ ధిగ్భాగే,<br>
      సముద్ర మధ్యస్థిత బృహదారణ్యక క్షేతే ప్రభవాది షష్టి సంవత్సరాణాం మధ్యే, శ్రీ క్రోధి నామ సంవత్సరే, దక్షిణాయనే, హేమంతఋతౌ,<br>
      పుష్య మాసే, శుక్ల పక్షే, శుక్ల ------- తిధౌ ------ వాసరే -------- శుభనక్షత్రే శుభయోగే శుభకరణ ఏవంగుణ<br>
      విశేషణ విశిష్ఠాయాం శుభతిథౌ<br>
      శ్రీమాన్ -------- గోత్రస్య ------- నామధేయస్య, ధర్మపత్నీ ------- నామధేయస్య,<br>
      ।</p>
    <h2> పురుష సూక్తం</h2>

<p>ఓం తచ్ఛం॒-యోఀరావృ॑ణీమహే । గా॒తుం-యఀ॒జ్ఞాయ॑ । గా॒తుం-యఀ॒జ్ఞప॑తయే । దైవీ᳚ స్వ॒స్తిర॑స్తు నః । స్వ॒స్తిర్మాను॑షేభ్యః । ఊ॒ర్ధ్వం జి॑గాతు భేష॒జమ్ । శం నో॑ అస్తు ద్వి॒పదే᳚ । శం చతు॑ష్పదే ।<br>
ఓం శాంతిః॒ శాంతిః॒ శాంతిః॑ ॥</p>
    <b>ఆవాహనం</b>
<p>స॒హస్ర॑శీర్​షా॒ పురు॑షః । స॒హ॒స్రా॒క్షః స॒హస్ర॑పాత్ ।<br>
స భూమిం॑-విఀ॒శ్వతో॑ వృ॒త్వా । అత్య॑తిష్ఠద్దశాంగు॒లమ్ ॥</p>
    <b>ఆసనం</b>
<p>పురు॑ష ఏ॒వేదగ్ం సర్వం᳚ । యద్భూ॒తం-యఀచ్చ॒ భవ్యం᳚ ।<br>
ఉ॒తామృ॑త॒త్వ స్యేశా॑నః । యదన్నే॑నాతి॒రోహ॑తి ॥</p>
    <b>పాద్యం</b>
<p>ఏ॒తావా॑నస్య మహి॒మా । అతో॒ జ్యాయాగ్॑శ్చ॒ పూరు॑షః ।<br>
పాదో᳚ఽస్య॒ విశ్వా॑ భూ॒తాని॑ । త్రి॒పాద॑స్యా॒మృతం॑ ది॒వి ॥</p>
    <b>అర్ఘ్యం</b>
<p>త్రి॒పాదూ॒ర్ధ్వ ఉదై॒త్పురు॑షః । పాదో᳚ఽస్యే॒హాఽఽభ॑వా॒త్పునః॑ ।<br>
తతో॒ విష్వ॒ఙ్​వ్య॑క్రామత్ । సా॒శ॒నా॒న॒శ॒నే అ॒భి ॥</p>
    <b>ఆచమనం</b>
<p>తస్మా᳚ద్వి॒రాడ॑జాయత । వి॒రాజో॒ అధి॒ పూరు॑షః ।<br>
స జా॒తో అత్య॑రిచ్యత । ప॒శ్చాద్భూమి॒మథో॑ పు॒రః ॥</p>
    <b>స్నానం</b>
<p>యత్పురు॑షేణ హ॒విషా᳚ । దే॒వా య॒జ్ఞమత॑న్వత ।<br>
వ॒సం॒తో అ॑స్యాసీ॒దాజ్యం᳚ । గ్రీ॒ష్మ ఇ॒ధ్మశ్శ॒రధ్ధ॒విః ॥</p>
<p>స॒ప్తాస్యా॑సన్పరి॒ధయః॑ । త్రిః స॒ప్త స॒మిధః॑ కృ॒తాః ।<br>
దే॒వా యద్య॒జ్ఞం త॑న్వా॒నాః । అబ॑ధ్న॒న్-పురు॑షం ప॒శుమ్ ॥</p>
    <b>వస్త్రం</b>
<p>తం-యఀ॒జ్ఞం బ॒ర్॒హిషి॒ ప్రౌక్షన్॑ । పురు॑షం జా॒తమ॑గ్ర॒తః ।<br>
తేన॑ దే॒వా అయ॑జంత । సా॒ధ్యా ఋష॑యశ్చ॒ యే ॥</p>
    <b>యజ్ఞోపవీతం</b>
<p>తస్మా᳚ద్య॒జ్ఞాథ్స॑ర్వ॒హుతః॑ । సంభృ॑తం పృషదా॒జ్యమ్ ।<br>
ప॒శూగ్గ్-స్తాగ్గ్-శ్చ॑క్రే వాయ॒వ్యాన్॑ । ఆ॒ర॒ణ్యాన్-గ్రా॒మ్యాశ్చ॒ యే ॥</p>
    <b>గంధం</b>
<p>తస్మా᳚ద్య॒జ్ఞాథ్స॑ర్వ॒హుతః॑ । ఋచః॒ సామా॑ని జజ్ఞిరే ।<br>
ఛందాగ్ం॑సి జజ్ఞిరే॒ తస్మా᳚త్ । యజు॒స్తస్మా॑దజాయత ॥</p>
    <b>పుష్పా భరణం</b>
<p>తస్మా॒దశ్వా॑ అజాయంత । యే కే చో॑భ॒యాద॑తః ।<br>
గావో॑ హ జజ్ఞిరే॒ తస్మా᳚త్ । తస్మా᳚జ్జా॒తా అ॑జా॒వయః॑ ॥</p>
    <b>ధూపం</b>
<p>యత్పురు॑షం॒-వ్యఀ ॑దధుః । క॒తి॒థా వ్య॑కల్పయన్న్ ।<br>
ముఖం॒ కిమ॑స్య॒ కౌ బా॒హూ । కావూ॒రూ పాదా॑వుచ్యేతే ॥</p>
    <b>దీపం</b>
<p>బ్రా॒హ్మ॒ణో᳚ఽస్య॒ ముఖ॑మాసీత్ । బా॒హూ రా॑జ॒న్యః॑ కృ॒తః ।<br>
ఊ॒రూ తద॑స్య॒ యద్వైశ్యః॑ । ప॒ద్భ్యాగ్ం శూ॒ద్రో అ॑జాయతః ॥</p>
    <b>నైవేద్యం</b>
<p>చం॒ద్రమా॒ మన॑సో జా॒తః । చక్షోః॒ సూర్యో॑ అజాయత ।<br>
ముఖా॒దింద్ర॑శ్చా॒గ్నిశ్చ॑ । ప్రా॒ణాద్వా॒యుర॑జాయత ॥</p>
    <p>మధ్యే మధ్యే పానీయాం సమర్పయామి - అమృతమస్తు అమృతపిధానమసి<br>
      పరబ్రహ్మణే నమః  సర్వేభ్యో దేవేభ్యో నమః<br>
      ఉత్తరా పోశనం సమర్పయామి , హస్తౌ ప్రక్షాళనం సమర్పయామి<br>
      పాదౌ ప్రక్షాళనం సమర్పయామి , శుద్ధాచమనీయాం సమర్పయామి<br></p>
    <b>తాంబూలం</b>
<p>నాభ్యా॑ ఆసీదం॒తరి॑క్షమ్ । శీ॒ర్​ష్ణో ద్యౌః సమ॑వర్తత ।<br>
ప॒ద్భ్యాం భూమి॒ర్దిశః॒ శ్రోత్రా᳚త్ । తథా॑ లో॒కాగ్ం అ॑కల్పయన్న్ ॥</p>
    <b>మంత్రపుష్పం - నమస్కారం</b>
<p>వేదా॒హమే॒తం పురు॑షం మ॒హాంతం᳚ । ఆ॒ది॒త్యవ॑ర్ణం॒ తమ॑స॒స్తు పా॒రే ।<br>
సర్వా॑ణి రూ॒పాణి॑ వి॒చిత్య॒ ధీరః॑ । నామా॑ని కృ॒త్వాఽభి॒వద॒న్॒, యదాఽఽస్తే᳚ ॥</p>
<p>ధా॒తా పు॒రస్తా॒ద్యము॑దాజ॒హార॑ । శ॒క్రః ప్రవి॒ద్వా-న్ప్ర॒దిశ॒శ్చత॑స్రః ।<br>
తమే॒వం-విఀ॒ద్వాన॒మృత॑ ఇ॒హ భ॑వతి । నాన్యః పంథా॒ అయ॑నాయ విద్యతే ॥</p>
<p>య॒జ్ఞేన॑ య॒జ్ఞమ॑యజంత దే॒వాః । తాని॒ ధర్మా॑ణి ప్రథ॒మాన్యా॑సన్న్ ।<br>
తే హ॒ నాకం॑ మహి॒మానః॑ సచంతే । యత్ర॒ పూర్వే॑ సా॒ధ్యాః సంతి॑ దే॒వాః ॥</p>
<p>అ॒ద్భ్యః సంభూ॑తః పృథి॒వ్యై రసా᳚చ్చ । వి॒శ్వక॑ర్మణః॒ సమ॑వర్త॒తాధి॑ ।<br>
తస్య॒ త్వష్టా॑ వి॒దధ॑ద్రూ॒పమే॑తి । తత్పురు॑షస్య॒ విశ్వ॒మాజా॑న॒మగ్రే᳚ ॥</p>
<p>వేదా॒హమే॒తం పురు॑షం మ॒హాంతం᳚ । ఆ॒ది॒త్యవ॑ర్ణం॒ తమ॑సః॒ పర॑స్తాత్ ।<br>
తమే॒వం-విఀ॒ద్వాన॒మృత॑ ఇ॒హ భ॑వతి । నాన్యః పంథా॑ విద్య॒తేఽయ॑నాయ ॥</p>
<p>ప్ర॒జాప॑తిశ్చరతి॒ గర్భే॑ అం॒తః । అ॒జాయ॑మానో బహు॒ధా విజా॑యతే ।<br>
తస్య॒ ధీరాః॒ పరి॑జానంతి॒ యోనిం᳚ । మరీ॑చీనాం ప॒దమి॑చ్ఛంతి వే॒ధసః॑ ॥</p>
<p>యో దే॒వేభ్య॒ ఆత॑పతి । యో దే॒వానాం᳚ పు॒రోహి॑తః ।<br>
పూర్వో॒ యో దే॒వేభ్యో॑ జా॒తః । నమో॑ రు॒చాయ॒ బ్రాహ్మ॑యే ॥</p>
<p>రుచం॑ బ్రా॒హ్మం జ॒నయం॑తః । దే॒వా అగ్రే॒ తద॑బ్రువన్న్ ।<br>
యస్త్వై॒వం బ్రా᳚హ్మ॒ణో వి॒ద్యాత్ । తస్య॑ దే॒వా అస॒న్ వశే᳚ ॥</p>
<p>హ్రీశ్చ॑ తే ల॒క్ష్మీశ్చ॒ పత్న్యౌ᳚ । అ॒హో॒రా॒త్రే పా॒ర్​శ్వే ।<br>
నక్ష॑త్రాణి రూ॒పమ్ । అ॒శ్వినౌ॒ వ్యాత్తం᳚ ।<br>
ఇ॒ష్టం మ॑నిషాణ । అ॒ముం మ॑నిషాణ । సర్వం॑ మనిషాణ ॥</p>
<p>తచ్ఛం॒-యోఀరావృ॑ణీమహే । గా॒తుం-యఀ॒జ్ఞాయ॑ । గా॒తుం-యఀ॒జ్ఞప॑తయే । దైవీ᳚ స్వ॒స్తిర॑స్తు నః । స్వ॒స్తిర్మాను॑షేభ్యః । ఊ॒ర్ధ్వం జి॑గాతు భేష॒జమ్ । శం నో॑ అస్తు ద్వి॒పదే᳚ । శం చతు॑ష్పదే ।<br>
ఓం శాంతిః॒ శాంతిః॒ శాంతిః॑ ॥<br>

<p><b>విష్ణు స్తోత్రం</b><br>
శాంతాకారం భుజగశయనం పద్మనాభం సురేశం<br>
విశ్వాధారం గగన సదృశం మేఘవర్ణం శుభాంగమ్ ।<br>
లక్ష్మీకాంతం కమలనయనం-యోఀగిహృద్ధ్యానగమ్యం<br>
వందే విష్ణుం భవభయహరం సర్వలోకైకనాథమ్ ॥</p>
<p><b>గాయత్రి మంత్రం</b><br>
ఓం భూర్భువ॒స్సువః॒ । తథ్స॑వి॒తుర్వరే᳚ణ్యం॒ ।<br>
భర్గో॑ దే॒వస్య॑ ధీమహి । ధియో॒ యో నః॑ ప్రచోదయా᳚త్ ॥</p>
<p><b>శివ స్తోత్రం</b><br>
త్ర్యం॑బకం-యఀజామహే సుగం॒ధిం పు॑ష్టి॒వర్ధ॑నమ్ । <br>
ఉ॒ర్వా॒రు॒కమి॑వ॒ బంధ॑నాన్-మృత్యో॑ర్-ముక్షీయ॒ మాఽమృతా᳚త్ ॥</p>
<p>వందే శంభుముమాపతిం సురగురుం-వంఀదే జగత్కారణం <br>
వందే పన్నగభూషణం శశిధరం-వంఀదే పశూనాం పతిం‌ ।<br>
వందే సూర్యశశాంక వహ్నినయనం-వంఀదే ముకుందప్రియం<br>
వందే భక్తజనాశ్రయం చ వరదం-వంఀదే శివం శంకరం‌ ॥</p>
<p><b>సుబ్రహ్మణ్య స్తోత్రం</b><br>
శక్తిహస్తం-విఀరూపాక్షం శిఖివాహం షడాననం<br>
దారుణం రిపురోగఘ్నం భావయే కుక్కుట ధ్వజమ్ ।<br>
స్కందం షణ్ముఖం దేవం శివతేజం చతుర్భుజం<br>
కుమారం స్వామినాధం తం కార్తికేయం నమామ్యహమ్ ॥</p>
<p><b>గురు శ్లోకః</b><br>
గురుర్బ్రహ్మా గురుర్విష్ణుః గురుర్దేవో మహేశ్వరః ।<br>
గురుః సాక్షాత్ పరబ్రహ్మా తస్మై శ్రీ గురవే నమః ॥</p>
<p><b>హనుమ స్తోత్రాః</b><br>
మనోజవం మారుత తుల్యవేగం జితేంద్రియం బుద్ధిమతాం-వఀరిష్టమ్ ।<br>
వాతాత్మజం-వాఀనరయూధ ముఖ్యం శ్రీరామదూతం శిరసా నమామి ॥</p>
<p>బుద్ధిర్బలం-యఀశోధైర్యం నిర్భయత్వమరోగతా ।<br>
అజాడ్యం-వాఀక్పటుత్వం చ హనుమస్స్మరణాద్-భవేత్ ॥</p>
<p>జయత్యతి బలో రామో లక్ష్మణస్య మహాబలః ।<br>
రాజా జయతి సుగ్రీవో రాఘవేణాభి పాలితః ॥</p>
<p>దాసోఽహం కోసలేంద్రస్య రామస్యాక్లిష్ట కర్మణః ।<br>
హనుమాన్ శత్రుసైన్యానాం నిహంతా మారుతాత్మజః ॥</p>
<p><b>శ్రీరామ స్తోత్రాం</b><br>
శ్రీ రామ రామ రామేతి రమే రామే మనోరమే<br>
సహస్రనామ తత్తుల్యం రామ నామ వరాననే</p>
<p>శ్రీ రామచంద్రః శ్రితపారిజాతః సమస్త కళ్యాణ గుణాభిరామః ।<br>
సీతాముఖాంభోరుహాచంచరీకో నిరంతరం మంగళమాతనోతు ॥</p>
<p><b>శ్రీకృష్ణ స్తోత్రం</b><br>
మందారమూలే మదనాభిరామం<br>
బింబాధరాపూరిత వేణునాదమ్ ।<br>
గోగోప గోపీజన మధ్యసంస్థం<br>
గోపం భజే గోకుల పూర్ణచంద్రమ్ ॥</p>
<p><b>గరుడ స్వామి స్తోత్రం</b><br>
కుంకుమాంకితవర్ణాయ కుందేందు ధవళాయ చ ।<br>
విష్ణు వాహ నమస్తుభ్యం పక్షిరాజాయ తే నమః ॥</p>
<p><b>దక్షిణామూర్తి స్తోత్రం</b><br>
గురవే సర్వలోకానాం భిషజే భవరోగిణామ్ ।<br>
నిధయే సర్వ విద్యానాం శ్రీ దక్షిణామూర్తయే నమ ॥</p>
<p><b>సరస్వతీ శ్లోకః</b><br>
సరస్వతీ నమస్తుభ్యం-వఀరదే కామరూపిణీ ।<br>
విద్యారంభం కరిష్యామి సిద్ధిర్భవతు మే సదా ॥</p>
<p>యా కుందేందు తుషార హార ధవళా, యా శుభ్ర వస్త్రావృతా ।<br>
యా వీణా వరదండ మండిత కరా, యా శ్వేత పద్మాసనా ।<br>
యా బ్రహ్మాచ్యుత శంకర ప్రభృతిభిర్-దేవైః సదా పూజితా ।<br>
సా మాం పాతు సరస్వతీ భగవతీ నిశ్శేషజాడ్యాపహా ॥</p>
<p><b>లక్ష్మీ శ్లోకః</b><br>
లక్ష్మీం క్షీరసముద్ర రాజ తనయాం శ్రీరంగ ధామేశ్వరీమ్ ।<br>
దాసీభూత సమస్త దేవ వనితాం-లోఀకైక దీపాంకురామ్ ।<br>
శ్రీమన్మంధ కటాక్ష లబ్ధ విభవ బ్రహ్మేంద్ర గంగాధరామ్ ।<br>
త్వాం త్రైలోక్యకుటుంబినీం సరసిజాం-వంఀదే ముకుందప్రియామ్ ॥</p>
<p><b>దుర్గా దేవీ స్తోత్రం</b><br>
సర్వ స్వరూపే సర్వేశే సర్వ శక్తి సమన్వితే ।<br>
భయేభ్యస్తాహి నో దేవి దుర్గాదేవి నమోస్తుతే ॥</p>
<p><b>త్రిపురసుందరీ స్తోత్రం</b><br>
ఓంకార పంజర శుకీం ఉపనిషదుద్యాన కేళి కలకంఠీమ్ ।<br>
ఆగమ విపిన మయూరీం ఆర్యాం అంతర్విభావయేద్గౌరీమ్ ॥</p>
<p><b>దేవీ శ్లోకః</b><br>
సర్వ మంగల మాంగల్యే శివే సర్వార్థ సాధికే ।<br>
శరణ్యే త్ర్యంబకే దేవి నారాయణి నమోస్తుతే ॥</p>

<h2 >నీరాజనం - శ్రీ వేంకటేశ మంగళాశాసనం</h2>
<p>శ్రియః కాంతాయ కల్యాణనిధయే నిధయేఽర్థినామ్ ।<br>
శ్రీవేంకట నివాసాయ శ్రీనివాసాయ మంగళమ్ ॥ 1 ॥</p>
<p>లక్ష్మీ సవిభ్రమాలోక సుభ్రూ విభ్రమ చక్షుషే ।<br>
చక్షుషే సర్వలోకానాం వేంకటేశాయ మంగళమ్ ॥ 2 ॥</p>
<p>శ్రీవేంకటాద్రి శృంగాగ్ర మంగళాభరణాంఘ్రయే ।<br>
మంగళానాం నివాసాయ శ్రీనివాసాయ మంగళమ్ ॥ 3 ॥</p>
<p>సర్వావయవ సౌందర్య సంపదా సర్వచేతసామ్ ।<br>
సదా సమ్మోహనాయాస్తు వేంకటేశాయ మంగళమ్ ॥ 4 ॥</p>
<p>నిత్యాయ నిరవద్యాయ సత్యానంద చిదాత్మనే ।<br>
సర్వాంతరాత్మనే శ్రీమద్-వేంకటేశాయ మంగళమ్ ॥ 5 ॥</p>
<p>స్వత స్సర్వవిదే సర్వ శక్తయే సర్వశేషిణే ।<br>
సులభాయ సుశీలాయ వేంకటేశాయ మంగళమ్ ॥ 6 ॥</p>
<p>పరస్మై బ్రహ్మణే పూర్ణకామాయ పరమాత్మనే ।<br>
ప్రయుంజే పరతత్త్వాయ వేంకటేశాయ మంగళమ్ ॥ 7 ॥</p>
<p>ఆకాలతత్త్వ మశ్రాంత మాత్మనా మనుపశ్యతామ్ ।<br>
అతృప్త్యమృత రూపాయ వేంకటేశాయ మంగళమ్ ॥ 8 ॥</p>
<p>ప్రాయః స్వచరణౌ పుంసాం శరణ్యత్వేన పాణినా ।<br>
కృపయాఽఽదిశతే శ్రీమద్-వేంకటేశాయ మంగళమ్ ॥ 9 ॥</p>
<p>దయాఽమృత తరంగిణ్యా స్తరంగైరివ శీతలైః ।<br>
అపాంగై స్సించతే విశ్వం వేంకటేశాయ మంగళమ్ ॥ 10 ॥</p>
<p>స్రగ్-భూషాంబర హేతీనాం సుషమాఽఽవహమూర్తయే ।<br>
సర్వార్తి శమనాయాస్తు వేంకటేశాయ మంగళమ్ ॥ 11 ॥</p>
<p>శ్రీవైకుంఠ విరక్తాయ స్వామి పుష్కరిణీతటే ।<br>
రమయా రమమాణాయ వేంకటేశాయ మంగళమ్ ॥ 12 ॥</p>
<p>శ్రీమత్-సుందరజా మాతృముని మానసవాసినే ।<br>
సర్వలోక నివాసాయ శ్రీనివాసాయ మంగళమ్ ॥ 13 ॥</p>
<p>మంగళా శాసనపరైర్-మదాచార్య పురోగమైః ।<br>
సర్వైశ్చ పూర్వైరాచార్యైః సత్కృతాయాస్తు మంగళమ్ ॥ 14 ॥</p>

    <p>
    ఛత్ర చామర గీత నృత్య ఆందోళికా అశ్వారోహణ గజారోహణ<br>
    సమస్త రాజోపచరాన్ మనసా సమర్పయామి</p>
    <p>యస్య స్మృత్యాచ నామోక్త్యా తపః పూజా క్రియాదిషుః<br>
    న్యూనం సంపూర్ణతాం యాతి సద్యో వందే తమచ్యుతం</p>
    <p>మంత్ర హీనం క్రియాహీనం భక్తిహీనం జనార్దన,<br>
    యత్పూజితాం మాయాదేవ పరిపూర్ణం తదస్తుతే<br>
    అనయా యధా శక్తి పూజయాచ భగవాన్ సర్వాత్మకః</p>
    <p>శ్రీ లక్ష్మీ నారాయణః సుప్రసన్నః స్సుప్రీతో వరదో భవతు</p>

<p><b>శాంతి మంత్రం</b><br>
అసతోమా సద్గమయా ।<br>
తమసోమా జ్యోతిర్గమయా ।<br>
మృత్యోర్మా అమృతంగమయా ।<br>
ఓం శాంతిః శాంతిః శాంతిః</p>

<p><b>స్వస్తి మంత్రాః</b><br>
స్వస్తి ప్రజాభ్యః పరిపాలయంతాం <br>
న్యాయేన మార్గేణ మహీం మహీశాః ।<br>
గోబ్రాహ్మణేభ్య-శ్శుభమస్తు నిత్యం <br>
లోకా-స్సమస్తా-స్సుఖినో భవంతు ॥</p>
<p>కాలే వర్​షతు పర్జన్యః పృథివీ సస్యశాలినీ ।<br>
దేశోయం క్షోభరహితో బ్రాహ్మణాస్సంతు నిర్భయాః ॥</p>
<p><b>విశేష మంత్రాః</b><br>
పంచాక్షరీ మంత్రం - ఓం నమశ్శివాయ<br>
అష్టాక్షరీ మంత్రం - ఓం నమో నారాయణాయ<br>
ద్వాదశాక్షరీ మంత్రం - ఓం నమో భగవతే వాసుదేవాయ<br>
</p>



  `,
  styles: ``
})
export class SpiritualComponent {

}
